#双引号定义
s1 = "Hello"#每个字母、数字、汉字都是字符

#单引号定义
s2 = 'Python'   #项目中保持一种写法即可

#三引号定义
s3 = """

南京，我来了：
    你林，你绝对完了，
    擦干净，等着我吧！
    """


print(s1)
print(s2)
print(s3)

print(type(s1))
print(type(s2))
print(type(s3))

#定义字符串---> It's a good boy.
#使用转义字符  \'(单引号)  \"(双引号)  \n 换行  \t 制表符
s4 = 'It\'s awesome!'
print(s4)
print("你林来了\n什么?奶龙来了！")


# 字符串的基本操作
# 成员运算：
# x in s
# x not in s


# 连接运算
# s + t  实现字符串的拼接
# s * t  实现字符串的重复
# 注意：字符串的连接和重复会生成新的字符串对象，原有的字符串对象保持不变

#切片操作
# s[i]       s[i] 访问字符串中索引为i的字符，索引从0开始，负数索引从-1开始
# s[i:j]     s[i:j] 访问字符串中索引从i到j-1的字符，左闭右开区间
# s[i:j:k]   s[i:j:k] 访问字符串中索引从i到j-1的字符，步长为k


# 字串的常用方法
#